{
    "projects":[
        {
            "image": "https://i.pinimg.com/736x/34/ea/20/34ea20e0747020c021677987211a6353.jpg",
            "title": "Homie Bot",
            "description": "A custom discord bot engineered to improve the quality of life in my discord community. Ask me more about this project! I love using my engineering skills to solve real world problems.",
            "link": "https://github.com/kenneth-yu/discord-bot"
        },
        {
            "image": "https://t4.ftcdn.net/jpg/03/90/71/57/360_F_390715748_JS1Q9c0FRxAfhlO0oMPZdFvrlkx163AF.jpg",
            "title": "Auto Repair Shop",
            "description": "A business oriented website developed specifically for auto shop owners. This app keeps track of customers, cars, and their repairs. React and Redux Front-end and Ruby on Rails backend.",
            "link": "https://github.com/kenneth-yu/auto-repair-shop-client"
        },
        {
            "image": "https://lh3.googleusercontent.com/pw/ACtC-3dYEDmnRCFFJT-dp921sHxq6ZK-wuJHynSvVAXHjscb9ymYVST84pKO7OfJgnXYzvPb_FrPFksCORsE6rm2EzZ5u61FIzYm5DsGSzXupZ7Hyq-sxq7lgzxL0BGvUuPixXcNffC0hm1fG760MobECEo=w440-h378-no?authuser=0",
            "title": "Hubble Bubble Beeble Bobble",
            "description": "A fun game created using JavaScript and the Phazer 3 Game Library. Use the Arrow Keys to Move and the Space Bar to shoot bubbles! Defeat as many enemys as possible and rack up the highest score!",
            "link": "https://github.com/kenneth-yu/Hubble-Bubble-Beeble-Bobble/blob/master/README.md"
        },
        {
            "image": "https://lh3.googleusercontent.com/pw/ACtC-3cdqDpW4m9bRhl8PAhJ7H1MewN9JF7mHMo2waFKMd4G6p6qFUU3dL2mLNOpS_7Yy_A_R2xN_18VtklbM85VJM1r9HwMWN6OWqVQYX66uXuhlIQyyuFP0O_oJc5pFv0-2IXYcjWrZQPXSwBH20h3T4Y=w484-h372-no?authuser=0",
            "title": "Throwback Aim",
            "description": "A web recreation of AOL Instant Messenger.  Features draggable windows, the ability to create an account, login and send messages. The application features a React Front-End with Ruby on Rails Back-End.",
            "link": "https://github.com/kenneth-yu/throwback-aim-client"
        },
        {
            "image": "https://pbs.twimg.com/profile_images/928655749605199872/ygogGX2j.jpg",
            "title": "Arduino Clock Mod",
            "description": "An educational project where I decided to add in a light sensor to control the dimmer setting on my digital clock automatically. Watch the demo video in the Github readme for more information!",
            "link": "https://github.com/kenneth-yu/arduino-clock-mod"
        }

    ],
    "experience":[
        {
            "jobTitle": "Lead Software Engineer (Front-End)",
            "company": "Priceline",
            "jobDates": "June 2019 - Present",
            "description": [
                "Led the development of redesigning Priceline’s inhouse white-label application by leveraging our internal monorepo components. This helped integrate pre-existing code for faster feature adoption and ensuring user experience parity with the rest of the website. The initiative led to increasing click through rates and conversion rates up to 100%.",
                "Spearheaded the architecture and implementation for Priceline’s blog style application that utilizes Google’s Gemini Generative Ai. This project enabled the business to easily create a network of landing pages that took advantage of search engine optimizations for hundreds of destinations. This helped drive up to 25% more traffic to our search component.",
                "Improved the frontend performance and error monitoring strategy for all online marketing applications. Collaborated with other engineers and product teams to understand the preexisting solution and help identify current pain points. This allowed the team to make better data-driven decisions around supporting and improving the overall health of the frontend experience.",
                "Supported multiple business sub teams by investigating complex production issues and implementing rapid code changes to prevent potential revenue losses of up to $3,000,000 dollars a year. ",
                "Mentored associate and mid-level engineers by identifying their strength and weaknesses for strategic nurture and continuous improvement initiatives.",
                "Initiated and encouraged productive transparent communication between business and technology teams leading to a reduction of project timelines by up to 50%.",
                "Encouraged engineers to produce clear and concise documentation to promote intuitive knowledge transfers leading to quicker project onboarding."
            ]
        },
        {
            "jobTitle": "Associate Software Engineer (Full Stack)",
            "company": "M&T Bank",
            "mobileName": "M&T",
            "linkTag": "mtb",
            "jobDates": "June 2017 - Nov 2018",
            "description": [
                "Developed internal web applications for over 750 branches using C#, JavaScript, and ASP.NET",
                "Analyzed deprecated bank acquisition applications and rejuvenated functionality with new features",
                "Designed and optimized SQL servers with SQL Server Management Studio.",
                "Effectively communicated with business clients to design, wireframe and engineer first-rate solutions.", 
                "Updated and optimized application efficiency/workflow using whiteboards and Microsoft Visio.",
                "Provided prompt post deployment support for in-house apps via troubleshooting and feature updates.",
                "Interacted with clients using agile methodology for ideal solutions.",
                "Created necessary documentation to prevent potential government regulation audits."
            ]
        },
        {
            "jobTitle": "Front-End Developer (Intern)",
            "company": "Verifyed, Inc",
            "mobileName": "Verifyed",
            "linkTag": "verifyed",
            "jobDates": "May 2016 - Aug 2016",
            "description": [
                "Communicated efficiently with graphic designers to create front facing web pages using JavaScript, HTML/CSS, and Bootstrap.",
                "Developed web pages to be dynamic and intuitive with all screen sizes including mobile devices.",
                "Consulted with quality assurance to make revisions in a timely manner."
            ]
        },
        {
            "jobTitle": "Systems Administration Intern",
            "company": "Starline USA",
            "mobileName": "Starline",
            "linkTag": "starline",
            "jobDates": "Jan 2016 - May 2016",
            "description": [
                "Seamlessly upgrade company systems to up to date operating systems and programs.",
                "Aid in managing and upgrading network servers.",
                "Assist in the set up virtualization on system networks.",
                "Troubleshoot and resolve problems on the user side."
            ]
        }
    ]
}
